# __SQL Review__
<hr>

#### - Create _connection_ Python with your SQL Database!
#### - Use ``Sakila`` database!
#### - If there isn't ``Sakila`` in your SQL Dataset, follow this guidance: https://dev.mysql.com/doc/sakila/en/sakila-installation.html

___

In [1]:
import mysql.connector

In [2]:
import pandas
import numpy

## Create Connection

In [3]:
mydb = mysql.connector.connect(
    host= 'localhost',
    user='root',
    passwd='clayton0808',
    database='sakila'
)

## ``Tampilkan seluruh tabel di Database Sakila (Full Table)``

In [8]:
mycursor= mydb.cursor()
mycursor.execute('''
show full tables;
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

In [9]:
mycursor= mydb.cursor()
mycursor.execute('''
    select * from film 
    limit 1
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [10]:
mycursor= mydb.cursor()
mycursor.execute('''
    select * from category 
    limit 1
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

   category_id    name         last_update
0            1  Action 2006-02-15 04:46:27

In [11]:
mycursor= mydb.cursor()
mycursor.execute('''
    select * from film_category
    limit 1
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

<hr>

## __Soal__

### 1.

In [23]:
mycursor= mydb.cursor()
mycursor.execute('''
select film.title as title, category.name as Category, film.length as length 
from film join film_category using (film_id) join category using (category_id)
where Category.name='Comedy'
order by length 
limit 10
 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

              title Category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

### 2.

In [41]:
mycursor= mydb.cursor()
mycursor.execute('''
select category.name as kategori, count(film.title) as JumlahMovie, avg(film.rental_rate) as rataHargaSewa
from film 
inner join film_category
on film.film_id=film_category.film_id
inner join category
on film_category.category_id=category.category_id
group by kategori
order by JumlahMOVIE desc
 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

       kategori  JumlahMovie rataHargaSewa
0        Sports           74      3.125135
1       Foreign           73      3.099589
2        Family           69      2.758116
3   Documentary           68      2.666471
4     Animation           66      2.808182
5        Action           64      2.646250
6           New           63      3.116984
7         Drama           62      3.022258
8         Games           61      3.252295
9        Sci-Fi           61      3.219508
10     Children           60      2.890000
11       Comedy           58      3.162414
12     Classics           57      2.744386
13       Travel           57      3.235614
14       Horror           56      3.025714
15        Music           51      2.950784

### 3.

In [35]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from actor
limit 1
 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [43]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from film_actor
limit 1
 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03

In [48]:
mycursor= mydb.cursor()
mycursor.execute('''
select actor.actor_id as actor_id, actor.first_name as first_name, actor.last_name as last_name, count(film.title) as JumlahMovie
from actor 
inner join film_actor
on film_actor.actor_id=actor.actor_id
inner join film
on film.film_id=film_actor.film_id
group by actor_id
order by JumlahMovie desc
limit 10
 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

   actor_id first_name  last_name  JumlahMovie
0       107       GINA  DEGENERES           42
1       102     WALTER       TORN           41
2       198       MARY     KEITEL           40
3       181    MATTHEW     CARREY           39
4        23     SANDRA     KILMER           37
5        81   SCARLETT      DAMON           36
6        37        VAL     BOLGER           35
7       158     VIVIEN   BASINGER           35
8       106    GROUCHO      DUNST           35
9        13        UMA       WOOD           35

### 4.

In [68]:
mycursor= mydb.cursor()
mycursor.execute('''
select category.name as category, count(film.title) as JumlahMovie
from film 
inner join film_category
on film.film_id=film_category.film_id
inner join category
on film_category.category_id=category.category_id
inner join actor
inner join film_actor
on film_actor.actor_id=actor.actor_id
inner join film
on film.film_id=film_actor.film_id
group by category
having actor.first_name='Gina'
 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

ProgrammingError: 1066 (42000): Not unique table/alias: 'film'

In [67]:
mycursor= mydb.cursor()
mycursor.execute('''
select category.name as category, count(film.title) as JumlahMovie
from film 
inner join film_category
on film.film_id=film_category.film_id
inner join category
on film_category.category_id=category.category_id
group by category
having actor.first_name=(select actor.actor_id as actor_id, actor.first_name as first_name, actor.last_name as last_name
inner join film_actor
on film_actor.actor_id=actor.actor_id
inner join film
on film.film_id=film_actor.film_id
group by first_name
having first_name='Gina'

 
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pandas.DataFrame(myresult, columns=columns)
tables

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'inner join film_actor
on film_actor.actor_id=actor.actor_id
inner join film
on f' at line 9

### 5.